In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import yfinance as yf
# pip install yfinance --upgrade --no-cache-dir <- 이거 bash terminal 에서 실행
from pandas import DataFrame
# import plotly

# 폴더 생성
# os 라이브러리
#import os
#if not os.path.isdir("abcd"):
#    os.mkdir("abcd") # 폴더 생성

In [4]:
# 문제!
# 연도별로 그룹바이 연산, 시가총액 평균 구하기
data = [
    ["2017", "삼성", 500],
    ["2017", "LG", 300],    
    ["2017", "SK하이닉스", 200],
    ["2018", "삼성", 600],
    ["2018", "LG", 400],
    ["2018", "SK하이닉스", 300],    
]

columns = ["연도", "회사", "시가총액"]
df = DataFrame(data=data, columns=columns)
df

#result = df.groupby("연도")[["시가총액"]].mean()
#print(result)
#print(type(result))
# 이걸 데이터프레임으로 만들어야 합칠 수 있음. 그래서 데이터 프레임으로 만들어야 함.

#result = df.groupby("연도")[["시가총액"]].mean() #.to_frame() ?? 뭐지 d왜 나는 이미 df였지?
#result.columns = ['시가총액평균']
#print(result)
#print(type(result))

#df2 = df.join(result, on = '연도') # 연도로 지정해줘야, df와 result가 다른 형태임에도, 알아서 잘 찾아서 값 넣어줌.
#print(df2)

     연도      회사  시가총액
0  2017      삼성   500
1  2017      LG   300
2  2017  SK하이닉스   200
3  2018      삼성   600
4  2018      LG   400
5  2018  SK하이닉스   300

In [5]:
# 문제
# 시가총액평균 기준값으로
# 새로운 커럼 : 규모
# 대형주, 중소형주
# numpy.where 사용

In [6]:
result = df.groupby("연도")[["시가총액"]].mean()
print(result)

            시가총액
연도
2017  333.333333
2018  433.333333

In [8]:
result = df.groupby("연도")[["시가총액"]].mean()
result.columns = ['시가총액평균']

In [9]:
df2 = df.join(result, on = '연도') # 연도로 지정해줘야, df와 result가 다른 형태임에도, 알아서 잘 찾아서 값 넣어줌.
df2

     연도      회사  시가총액      시가총액평균
0  2017      삼성   500  333.333333
1  2017      LG   300  333.333333
2  2017  SK하이닉스   200  333.333333
3  2018      삼성   600  433.333333
4  2018      LG   400  433.333333
5  2018  SK하이닉스   300  433.333333

In [12]:
test1 = np.where(df2['시가총액평균']<400)
test1

(array([0, 1, 2]),)

In [13]:
test2 = np.where(df2['시가총액평균']<400, '중소형주' , '대형주')
test2

array(['중소형주', '중소형주', '중소형주', '대형주', '대형주', '대형주'], dtype='<U4')

In [15]:
df2['규모'] = np.where(df2['시가총액']<= df2['시가총액평균'] , '중소형주' , '대형주')
df2

     연도      회사  시가총액      시가총액평균    규모
0  2017      삼성   500  333.333333   대형주
1  2017      LG   300  333.333333  중소형주
2  2017  SK하이닉스   200  333.333333  중소형주
3  2018      삼성   600  433.333333   대형주
4  2018      LG   400  433.333333  중소형주
5  2018  SK하이닉스   300  433.333333  중소형주

In [16]:
# 위는, numpy.where 홀용해서 sereies 연산 한 것

In [17]:
df3=df2.drop('시가총액평균', axis=1)
df3

     연도      회사  시가총액    규모
0  2017      삼성   500   대형주
1  2017      LG   300  중소형주
2  2017  SK하이닉스   200  중소형주
3  2018      삼성   600   대형주
4  2018      LG   400  중소형주
5  2018  SK하이닉스   300  중소형주

# Multi Index

In [18]:
from pandas import DataFrame
import pandas as pd

data = [
    ["영업이익", "컨센서스", 1000, 1200],
    ["영업이익", "잠정치", 900, 1400],
    ["당기순이익", "컨센서스", 800, 900],
    ["당기순이익", "잠정치", 700, 800]
]

df = DataFrame(data=data)
df = df.set_index([0, 1])
df

               2     3
0     1
영업이익  컨센서스  1000  1200
      잠정치    900  1400
당기순이익 컨센서스   800   900
      잠정치    700   800

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
# 이 데이터프레임은 인덱스가 두개임!! multi inde

In [21]:
df.loc[('영업이익'),:]

         2     3
1
컨센서스  1000  1200
잠정치    900  1400

In [22]:
df.loc[('영업이익', '컨센서스'),:]

2    1000
3    1200
Name: (영업이익, 컨센서스), dtype: int64